w5d1/GoalApp/app/controllers/comments_controller.rb

  def create
    params[:comment][:author_id] = current_user.id
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("body", "author_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "Let's get buck"], ["author_id", 6], ["commentable_id", 5], ["commentable_type", "Goal"], ["created_at", "2015-01-13 01:31:44.083014"], ["updated_at", "2015-01-13 01:31:44.083014"]]