w5d1/GoalApp/app/controllers/goals_controller.rb

SELECT "goals".* FROM "goals" WHERE "goals"."privacy" = 'f'
---
  def index
    @goals = Goal.where(privacy: false)

INSERT INTO "goals" ("title", "body", "privacy", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "fuuuuuuucccckkk"], ["body", "thisss"], ["privacy", "t"], ["user_id", 5], ["created_at", "2015-01-12 23:06:54.486073"], ["updated_at", "2015-01-12 23:06:54.486073"]]
---
  def create
    @goal = current_user.goals.new(goal_params)

    if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "goals" SET "title" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["title", "shiiiiiiiiiiiiiiiiiiiit"], ["updated_at", "2015-01-12 23:30:13.227185"], ["id", 2]]
---
  def update
    @goal = Goal.find(params[:id])

    if @goal.update(goal_params)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 1]]
---
  def destroy
    @goal = Goal.find(params[:id])
    @goal.destroy