w5d1/GoalApp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" IN (1)
---
  def show
    @user = User.includes(:goals).find(params[:id])