w5d1/GoalApp/app/views/users/show.html.erb

<ul>
  <% @user.goals.each do |goal| %>
---
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" IN (1)