w7d2/pokedex2/app/controllers/pokemon_controller.rb

	def create
		@pokemon = Pokemon.new(pokemon_params)

		if @pokemon.save
---
INSERT INTO "pokemons" ("attack", "created_at", "defense", "image_url", "moves", "name", "poke_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def update
		@pokemon = Pokemon.find(params[:id])
		if @pokemon.update(pokemon_params)
---
SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "pokemons" SET "moves" = $1, "name" = $2, "updated_at" = $3 WHERE "pokemons"."id" = 3  [["moves", "---\n- tackle\n- smog\n- sludge\n"], ["name", "Weezingv"], ["updated_at", "2015-01-28 00:33:08.181293"]]