w7d1/pokedex/app/controllers/pokemon_controller.rb

INSERT INTO "pokemons" ("attack", "created_at", "defense", "image_url", "moves", "name", "poke_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@pokemon = Pokemon.new(pokemon_params)

		if @pokemon.save