w7d5/trello/app/controllers/api/boards_controller.rb

INSERT INTO "boards" ("created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 31 Jan 2015 00:10:18 UTC +00:00], ["title", "Board #2"], ["updated_at", Sat, 31 Jan 2015 00:10:18 UTC +00:00], ["user_id", 3]]
---
    def create
      @board = current_user.boards.new(board_params)

      if @board.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", "4"]]
---
    def show
      @board = Board.includes(:members, lists: :cards).find(params[:id])